// Дано температуру у кельвінах.Перевести її у шкалу Цельсія і вивести на екран скільки на 1
//градус за Цельсієм припадає градусів за Кельвіним.
#include <iostream>
#include <math.h>
using namespace std;

int main()
{
	setlocale(LC_CTYPE, "ukr");
	double a = 0;
	double c = 0;
	// 1 k= 1c + 273,15;
	// 1c = 1k -273,15; 
	cout << "введiть температуру у Кельвiнах: ";
	cin >> a;
	c = a - 273, 15;
	cout << "результат цього переведення: " << c << endl;
	cout << "1С = 274,15K";
}

